---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.FabricHostReference
source: html/e7b4d579-4362-b7b4-3aeb-4edd50c366e2.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.FabricHostReference Property

Controls if Single Fabric Sheet should be cut by the Host Cover

## Syntax (C#)
```csharp
public FabricHostReference FabricHostReference { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration